CREATE DATABASE Storage
GO
USE Storage
GO
CREATE TABLE ProductTypes (
    ProductTypeID INT IDENTITY PRIMARY KEY,
    Type VARCHAR(255)
);
GO
CREATE TABLE Suppliers (
    SupplierID INT IDENTITY PRIMARY KEY,
    Name VARCHAR(255),
    Address VARCHAR(255) NULL, 
    Phone VARCHAR(20) NULL 
);
GO
CREATE TABLE Products (
    ProductID INT IDENTITY PRIMARY KEY,
    Name VARCHAR(255),
    ProductTypeID INT,
    SupplierID INT,
    Cost DECIMAL(10, 2),
    FOREIGN KEY (ProductTypeID) REFERENCES ProductTypes(ProductTypeID),
    FOREIGN KEY (SupplierID) REFERENCES Suppliers(SupplierID)
);
GO
CREATE TABLE Deliveries (
    DeliveryID INT IDENTITY PRIMARY KEY,
    ProductID INT,
    Date DATE,
    Quantity INT,
    FOREIGN KEY (ProductID) REFERENCES Products(ProductID)
);
GO

INSERT INTO ProductTypes (Type)
VALUES 
    (N'Электроника'),
    (N'Одежда'),
    (N'Мебель'),
    (N'Игрушки'),
    (N'Книги'),
    (N'Товары для дома'),
    (N'Продукты питания и напитки'),
    (N'Фармацевтика'),
    (N'Канцелярские товары'),
    (N'Косметика'),
    (N'Спортивные товары'),
    (N'Автозапчасти'),
    (N'Товары для сада'),
    (N'Товары для животных'),
    (N'Строительные материалы');
	GO

-- Поставщики

INSERT INTO Suppliers (Name, Address, Phone) VALUES
(N'ООО "ЭлектроМир"', N'ул. Хрещатик, 24, Киев, 01001', '+380 (44) 123-45-67'),
(N'ЧП "Книжный Рай"', N'просп. Свободы, 48, Львов, 79000', '+380 (32) 765-43-21'),
(N'ООО "ДомТехника"', N'ул. Пушкинская, 12, Одесса, 65000', '+380 (48) 123-98-76'),
(N'ЧП "СпортТовары"', N'пр. Гагарина, 33, Харьков, 61000', '+380 (57) 987-65-43'),
(N'ООО "СтройМатериалы"', N'ул. Соборная, 5, Днепр, 49000', '+380 (56) 234-56-78'),
(N'ООО "АгроСнаб"', N'пер. Шевченко, 3, Запорожье, 69000', '+380 (61) 707-83-45'),
(N'ЧП "МебельШик"', N'бул. Шевченко, 8, Луганск, 91000', '+380 (64) 123-45-67'),
(N'ООО "ГарденСервис"', N'ул. Центральная, 21, Симферополь, 95000', '+380 (65) 987-65-43'),
(N'ООО "Канцелярский Мир"', N'просп. Мира, 19, Чернигов, 14000', '+380 (46) 765-43-21'),
(N'ЧП "ЭлитКосметика"', N'ул. Главная, 28, Полтава, 36000', '+380 (53) 234-56-78'),
(N'ООО "Вкусные Продукты"', N'ул. Богдана Хмельницкого, 45, Ивано-Франковск, 76000', '+380 (342) 987-65-43'),
(N'ЧП "ТехноСвет"', N'пр. Победы, 37, Тернополь, 46000', '+380 (352) 123-45-67'),
(N'ООО "Промышленные Решения"', N'ул. Короленко, 12, Хмельницкий, 29000', '+380 (382) 765-43-21'),
(N'ООО "АвтоЧасти"', N'пр. Металлургов, 9, Запорожье, 69000', '+380 (61) 234-56-78'),
(N'ЧП "Детский Мир"', N'ул. Степана Бандеры, 54, Львов, 79000', '+380 (32) 987-65-43'),
(N'ООО "Красота и Здоровье"', N'пр. Мира, 22, Черкассы, 18000', '+380 (472) 354-12-65'),
(N'ООО "Уютный Дом"', N'ул. Гагарина, 3, Житомир, 10000', '+380 (412) 987-65-43'),
(N'ЧП "СтройЭлемент"', N'пр. Центральный, 15, Винница, 21000', '+380 (432) 123-45-67'),
(N'ООО "Эко Продукты"', N'ул. Леси Украинки, 78, Ровно, 33000', '+380 (362) 765-43-21'),
(N'ЧП "ГлобалТрейд"', N'бул. Шевченко, 100, Ужгород, 88000', '+380 (312) 234-56-78');
GO
INSERT INTO Suppliers (Name, Address, Phone) VALUES
(N'ООО "Мода и Стиль"', N'ул. Хрещатик, 24, Киев, 01001', '+380 (44) 987-65-43');
GO



INSERT INTO Products (Name, ProductTypeID, SupplierID, Cost) VALUES
(N'Смартфон Galaxy S21', 1, 1, 69999.99),
(N'Ноутбук MacBook Pro', 1, 1, 129999.50),
(N'Электронная книга Kindle', 1, 2, 15999.00),
(N'Футболка мужская', 2, 21, 1199.99),
(N'Кроссовки беговые', 2, 4, 4999.95),
(N'Кофеварка Delonghi', 1, 12, 7999.99),
(N'Стиральная машина LG', 1, 12, 25999.90),
(N'Шкаф книжный', 3, 7, 11999.00),
(N'Игрушка мягкая "Мишка"', 4, 15, 899.99),
(N'Планшет iPad Air', 1, 1, 56999.99),
(N'Парфюм Chanel No5', 10, 10, 10999.99),
(N'Спортивный инвентарь: скакалка', 11, 4, 299.99),
(N'Автомобильные шины', 12, 14, 7999.00),
(N'Удобрения для растений', 8, 6, 499.99),
(N'Корм для собак', 14, 15, 2499.99),
(N'Строительная краска', 15, 5, 1599.99),
(N'Помада Loreal', 10, 10, 799.99),
(N'Ручка шариковая', 9, 9, 49.99),
(N'Тетрадь в клетку', 9, 9, 14.99),
(N'Соковыжималка Philips', 1, 12, 2999.99),
(N'Беспроводные наушники', 1, 5, 12999.99),
(N'Велосипед горный', 11, 4, 23999.50),
(N'Умные часы', 1, 1, 18999.00),
(N'Джинсы женские', 2, 2, 2799.99),
(N'Спортивный костюм', 2, 4, 5999.95),
(N'Микроволновая печь Samsung', 1, 3, 9999.99),
(N'Холодильник Bosch', 1, 12, 45999.90),
(N'Книжная полка', 3, 7, 4999.00),
(N'Детский велосипед', 4, 4, 7999.99),
(N'Монитор Dell', 1, 1, 14999.99),
(N'Паровая станция Tefal', 1, 3, 8999.99),
(N'Шорты мужские', 2, 21, 1199.00),
(N'Зимняя шина Michelin', 12, 14, 10999.00),
(N'Семена помидоров', 13, 8, 99.99),
(N'Корм для кошек', 14, 15, 1999.99),
(N'Лак для ногтей', 10, 16, 299.99),
(N'Зубная паста Colgate', 10, 17, 199.99),
(N'Блокнот А5', 9, 9, 59.99),
(N'Мыло Dove', 10, 19, 99.99),
(N'Чайник электрический', 1, 12, 2499.99),
(N'Плойка для волос', 1, 1, 2999.00),
(N'Мужской ремень', 2, 21, 899.99),
(N'Солнцезащитные очки', 2, 21, 1499.99),
(N'Электрогриль', 1, 12, 6599.99),
(N'Настольная лампа', 1, 12, 2399.99),
(N'Клавиатура беспроводная', 1, 1, 1999.99),
(N'Средство для мытья посуды', 10, 11, 299.99),
(N'Кроссовки для бега', 11, 4, 7499.99),
(N'Масло моторное', 12, 13, 4500.00),
(N'Шампунь Head & Shoulders', 10, 15, 399.99),
(N'Маска для лица', 10, 10, 250.99),
(N'Карандаши цветные', 9, 9, 499.99),
(N'Журнал мод', 9, 10, 299.99),
(N'Гель для душа Nivea', 10, 19, 349.99),
(N'Фильтр для воды', 1, 5, 1899.99),
(N'Гантели 5 кг', 11, 4, 2599.00),
(N'Подгузники', 14, 15, 1199.00),
(N'Антисептик для рук', 10, 20, 299.00),
(N'Игровая консоль PlayStation 5', 1, 1, 46999.99),
(N'Оливковое масло Extra Virgin', 7, 11, 599.99),
(N'Органический кофе в зернах', 7, 11, 1099.50),
(N'Цельнозерновой хлеб', 7, 19, 199.99),
(N'Натуральный йогурт', 7, 19, 299.99),
(N'Био кефир', 7, 19, 249.99),
(N'Детский пазл "Космос"', 4, 15, 499.99),
(N'Игрушечная кухня', 4, 15, 2999.99);
GO


INSERT INTO Deliveries (ProductID, Date, Quantity) VALUES
(1, '2023-01-10', 100),
(2, '2023-01-15', 150),
(3, '2023-02-01', 200),
(4, '2023-02-05', 250),
(5, '2023-02-10', 300),
(6, '2023-03-01', 350),
(7, '2023-03-15', 400),
(8, '2023-04-01', 450),
(9, '2023-04-15', 500),
(10, '2023-05-01', 550);
GO
INSERT INTO Deliveries (ProductID, Date, Quantity) VALUES
(11, '2023-05-15', 600),
(12, '2023-06-01', 650),
(13, '2023-06-15', 700),
(14, '2023-07-01', 750),
(15, '2023-07-15', 800),
(16, '2023-08-01', 850),
(17, '2023-08-15', 900),
(18, '2023-09-01', 950),
(19, '2023-09-15', 1000),
(20, '2023-10-01', 1050),
(21, '2023-01-10', 100),
(22, '2023-01-15', 150),
(23, '2023-02-01', 200),
(24, '2023-02-05', 250),
(25, '2023-02-10', 300),
(26, '2023-03-01', 350),
(27, '2023-03-15', 400),
(28, '2023-04-01', 450),
(29, '2023-04-15', 500),
(30, '2023-05-01', 550);
GO
INSERT INTO Deliveries (ProductID, Date, Quantity) VALUES
(31, '2023-05-15', 600),
(32, '2023-06-01', 650),
(33, '2023-06-15', 700),
(34, '2023-07-01', 750),
(35, '2023-07-15', 800),
(36, '2023-08-01', 850),
(37, '2023-08-15', 900),
(38, '2023-09-01', 950),
(39, '2023-09-15', 1000),
(40, '2023-10-01', 1050),
(41, '2023-01-10', 100),
(42, '2023-01-15', 150),
(43, '2023-02-01', 200),
(44, '2023-02-05', 250),
(45, '2023-02-10', 300),
(46, '2023-03-01', 350),
(47, '2023-03-15', 400),
(48, '2023-04-01', 450),
(49, '2023-04-15', 500),
(40, '2023-05-01', 550),
(41, '2023-05-15', 600),
(42, '2023-06-01', 650),
(43, '2023-06-15', 700),
(44, '2023-07-01', 750),
(45, '2023-07-15', 800),
(46, '2023-08-01', 850),
(47, '2023-08-15', 900),
(48, '2023-09-01', 950),
(49, '2023-09-15', 1000),
(50, '2023-10-01', 1050);
GO
INSERT INTO Deliveries (ProductID, Date, Quantity) VALUES
(51, '2023-05-15', 600),
(52, '2023-06-01', 650),
(53, '2023-06-15', 700),
(54, '2023-07-01', 750),
(55, '2023-07-15', 800),
(56, '2023-08-01', 850),
(57, '2023-08-15', 900),
(58, '2023-09-01', 950),
(59, '2023-09-15', 1000),
(60, '2023-10-01', 1050),
(61, '2023-01-10', 100),
(62, '2023-01-15', 150),
(63, '2023-02-01', 200),
(64, '2023-02-05', 250),
(65, '2023-02-10', 300),
(66, '2023-03-01', 350);
GO

INSERT INTO Deliveries (ProductID, Date, Quantity) VALUES
(8, '2023-04-01', 450),
(9, '2023-04-15', 500),
(1, '2023-05-15', 600),
(2, '2023-06-01', 650),
(3, '2023-06-15', 700),
(4, '2023-07-01', 750),
(5, '2023-07-15', 800),
(46, '2023-08-01', 850),
(47, '2023-08-15', 900),
(48, '2023-09-01', 950),
(9, '2023-09-15', 1000),
(5, '2023-10-01', 1050);
GO
